export const servicesData = [
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
    { number: '01', name: 'Оцінка відповідності медичних виробів' },
  ];