import firstMember from '../../images/first-member.png';
import secondMember from '../../images/second-member.png';

export const teamMembersData = [
    {
      id: 1,
      src: firstMember,
      quote:
        'Вища освіта в сфері метрології, стандартизації і сертифікації та другу вищу фінансово-економічну освіту. Активна участь в міжнародних конгресах, семінарах, підготовка тематичних публікацій для спеціалізованих видань. Досвід роботи в даній сфері більше 8 років. Знання регуляторного законодавства України і ЄС.',
      name: 'Євгенія\nАндрущенко',
      position: 'Директор з розвитку бізнесу',
    },
    {
      id: 2,
      src: secondMember,
      quote:
        'Голова робочої групи виробників медичних виробів і обладнання Американської торгової палати в Україні. 11 років досвіду в сфері фармацевтичного і медичного права. Постійний учасник і голова експертних і робочих груп при Міністерсві та відомствах України в питаннях регуляторних особливостей обігу лікарських засобів та медичних виробів в Україні. Більше 50 публікацій у профільних медіа.',
      name: 'Микола\nРоманьок',
      position: 'Директор',
    },
  ];